In [1]:
import pandas as pd
import numpy as np

In [2]:
my_dictionary = {"James" : [40,30,np.nan],"Kirk" : [20,np.nan,50],"Lars" : [30,50,40]}

In [3]:
my_data_frame = pd.DataFrame(my_dictionary)

In [4]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [6]:
my_data_frame.dropna()
#NaN geçen satırları sil

   James  Kirk  Lars
0   40.0  20.0    30

In [9]:
my_data_frame.dropna(axis = 1)

   Lars
0    30
1    50
2    40

In [10]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [11]:
my_new_dictionary = {"James" : [40,30,np.nan],"Kirk" : [20,np.nan,50],"Lars" : [30,50,40],"Rob" : [45,np.nan,np.nan]}

In [12]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [14]:
my_new_data_frame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [21]:
my_new_data_frame.dropna(axis = 1, thresh = 2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [22]:
my_new_data_frame.fillna(20)

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0

In [23]:
#group by

In [35]:
salary_dict = {"Programming Language" : ["Python","Python","Python","Java","Java","Swift"], "Name" : ["A","B","C","D","E","F"], "Salary" : [100,90,80,70,60,50]}

In [36]:
salary_frame = pd.DataFrame(salary_dict)

In [37]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [39]:
group_object = salary_frame.groupby("Programming Language")

In [49]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [53]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      50

In [66]:
group_object.min("Salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [67]:
group_object.max("Salary")

                      Salary
Programming Language
Java                      70
Python                   100
Swift                     50

In [68]:
help(group_object.min)

Help on method min in module pandas.core.groupby.groupby:

min(numeric_only: 'bool' = False, min_count: 'int' = -1, engine: 'str | None' = None, engine_kwargs: 'dict[str, bool] | None' = None) method of pandas.core.groupby.generic.DataFrameGroupBy instance
    Compute min of group values.

    Parameters
    ----------
    numeric_only : bool, default False
        Include only float, int, boolean columns.

        .. versionchanged:: 2.0.0

            numeric_only no longer accepts ``None``.

    min_count : int, default -1
        The required number of valid values to perform the operation. If fewer
        than ``min_count`` non-NA values are present the result will be NA.

    Returns
    -------
    Series or DataFrame
        Computed min of values within each group.

In [69]:
group_object.min(numeric_only = True)

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [70]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [71]:
my_dict1 = {"Name" : ["A","B","C","D"],
           "Sports" : ["Basketball","Football","Tennis","Running"],
           "Calories" : [100,200,300,400]}

In [88]:
my_frame1 = pd.DataFrame(my_dict1, index = [0,1,2,3])

In [89]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [90]:
my_dict2 = {"Name" : ["E","F","G","H"],
           "Sports" : ["Basketball","Football","Tennis","Running"],
           "Calories" : [200,50,330,440]}

In [91]:
my_frame2 = pd.DataFrame(my_dict2, index = [4,5,6,7])

In [92]:
my_frame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H     Running       440

In [93]:
my_dict3 = {"Name" : ["I","J","K","L"],
           "Sports" : ["Basketball","Football","Tennis","Running"],
           "Calories" : [300,150,320,410]}

In [94]:
my_frame3 = pd.DataFrame(my_dict3, index = [8,9,10,11])

In [95]:
my_frame3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [96]:
#concatenation

In [97]:
pd.concat([my_frame1, my_frame2, my_frame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H     Running       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L     Running       410

In [98]:
#merge

In [99]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [100]:
pd.merge(my_frame1,my_frame2,on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [101]:
new_salary_frame = pd.DataFrame({"Name" : ["James","Kirk","Lars"], "Salary" : [10,20,30], "Age" : [60,65,70]})

In [102]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [105]:
new_salary_frame["Name"].nunique()

3

In [106]:
def grossToNet(salary):
    return salary * 0.65

In [107]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64